artillery/write.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: http://172.21.55.8
  phases:
    - duration: 30
      arrivalRate: 10
      rampTo: 30
      name: Spike phase
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
scenarios:
  - flow:
      - loop:
        - post:
            url: "/api/comment?listingId=66261a1e83fa59ebdcbac70f"
            json:
              text: "hello there"
            headers:
              authorization: "Bearer eyJhbGciOiJSUzI1NiIsInR5cCI6IkpXVCJ9.eyJzdWIiOiI2NjBlODExNzViMDkyZjc0N2ZjMDgyM2QiLCJlbWFpbCI6Impkb2VAbWFpbC5jb20iLCJyb2xlcyI6WyJVc2VyIl0sImlhdCI6MTcxNDc1NDM3NSwiZXhwIjoxNzE0NzcyMzc1fQ.ufHf4UzaBHm4SWKmCoDsHT0cjpnu89xzkmpR2F2mLTshGbrrDzkWGyGB4g_splT25yVcXGzvIS7WhMVpEMvtj4yEp1EQpxtgCiPVrlaxezb72K5bZBox0Lhi6L-28sF15V-Vl0KjZbrQo_OkDjGYoyy3LjGLu4LUUg8-wznM9wVTY-wtHrZV9gcmwL9PEmy_K49F7X9zVBgu3ylvAEXQXtAXtPOk9UzD1qYa9k0obzaY_6pF6tFAik8AvRljNXpLwPB4cRP6baw6IlmXa_-oBdmzWslRjcTjRsLy6DvTYADT6RxIqBV6glDovMsChW9CyU03EBx3rfDcHV8JEcY_nw"
        count: 100